# 3.14 Guia - SQL

In [25]:
import pandas as pd

In [ ]:
#Step1 --> install  sqlalchemy  --> pip3 install sqlalchemy              (Run cmd prompt as Admin)

#Step2 --> install PyMySQL --> pip3 install PyMySQL                     (Run cmd prompt as Admin)

#Step3 --> create database using sqlYog (or sqlworkbench) , Give name , say pandasdb

#Step4 --> create tables within pandasdb
# Table1 --> customers (with id (pkid, autoincr), name , phone_no as columns)
# Table2 --> orders (with id (pkid, autoincr) , name, amount, customer_id  (foreign key)
# It maps to id of customers table) as columns)

#Step5 --> populate table1 and table2 with some data

In [26]:
import sqlalchemy

In [29]:

#https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_sql.html

#connection string examples
#http://pandas.pydata.org/pandas-docs/stable/io.html#engine-connection-examples

#engine is connection object (connect using connection string)
engine = sqlalchemy.create_engine('mysql+pymysql://root:admin@localhost:3306/pandasdb')

In [28]:
engine.table_names()

['customers', 'orders']

In [30]:
#read table1 in dataframe

df  = pd.read_sql_table("customers", engine)
df

    id   name   phone_no
0   10   Bill  123456789
1   11   John   23456789
2   12  Maria     126789
3  100  Smith  987654623

In [31]:
#read few columns from table1
df = pd.read_sql_table("customers",engine,columns=['phone_no'] )
df

    phone_no
0  123456789
1   23456789
2     126789
3  987654623

In [32]:
#https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_sql_query.html

#query
#SELECT customers.name, customers.phone_no, orders.name, orders.amount 
#	FROM customers INNER JOIN orders 
#	ON customers.id=orders.customer_id;

query = '''
SELECT customers.name, customers.phone_no, orders.name, orders.amount 
	FROM customers INNER JOIN orders 
	ON customers.id=orders.customer_id
'''
df = pd.read_sql_query(query,engine)     #https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_sql_query.html
df

    name   phone_no        name  amount
0   John   23456789       MotoG   10000
1  Maria     126789     Macbook   70000
2   Bill  123456789  TitanWatch   15000

In [33]:
query = '''
SELECT * FROM orders;
'''

df = pd.read_sql_query(query,engine)
df

   id        name  amount  customer_id
0   1       MotoG   10000           11
1   2     Macbook   70000           12
2   3  TitanWatch   15000           10

In [34]:
df = pd.read_csv("D:\\PythonProjects\\customers.csv")
df

   Customer Name   Phone No
0   Rahul Sharma    9123456
1   Manish Gupta  812345689
2   Pavan Goenka   70123456
3  Mukesh Ambani    6134567

In [35]:
#column names in csv file are different than the columns of "customers" tables
#So rename the columns of dataframe

new_df = df.rename(columns={                     #or use inplace=True in df.rename()
    'Customer Name' : 'name',
    'Phone No': 'phone_no'
})
new_df

            name   phone_no
0   Rahul Sharma    9123456
1   Manish Gupta  812345689
2   Pavan Goenka   70123456
3  Mukesh Ambani    6134567

In [36]:
#Insert new_df data into customers tables, 
#do not use index of new_df , so make it False
#if_exists='append', so that new_df data is appended to "customers" table,  default is Fail, 
#replace drops table beforeTABadding data
#use shift + TAB and see the details of parameters of to_sql() function
new_df.to_sql(
name='customers',
con=engine,
index=False,
if_exists='append'
)

#check the "customers table" using SQL workbench (or sqlyog)

In [37]:
#verify whether data is inserted in the table
query = '''
SELECT * FROM customers;
'''

pd.read_sql_query(query,engine)

    id           name   phone_no
0   10           Bill  123456789
1   11           John   23456789
2   12          Maria     126789
3  100          Smith  987654623
4  113   Rahul Sharma    9123456
5  114   Manish Gupta  812345689
6  115   Pavan Goenka   70123456
7  116  Mukesh Ambani    6134567

In [38]:
#real_sql is wrapper over read_sql_query() and read_sql_table()
#This function is a convenience wrapper around read_sql_table and read_sql_query
#https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_sql.html

pd.read_sql('customers',engine)

    id           name   phone_no
0   10           Bill  123456789
1   11           John   23456789
2   12          Maria     126789
3  100          Smith  987654623
4  113   Rahul Sharma    9123456
5  114   Manish Gupta  812345689
6  115   Pavan Goenka   70123456
7  116  Mukesh Ambani    6134567